app/views/questions/_form.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
---
            <%= label_tag :question,"Q1." %>
            <% if @question.question.present? %>