app/views/questions/_question.html.erb

SELECT "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
      <div class="mt-4 space-y-4 mb-6">
        <% if TypeOfQuiz.find(params[:type_of_quiz]).type.name == "Fill ups"%>
        Fill sentence : <input type="text" name="correct-answer" class="option-of-question options block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full">
        <% elsif TypeOfQuiz.find(params[:type_of_quiz]).type.name == "Jumbled Words" %>
        correct sequence : <input type="text" name="correct-answer" class="option-of-question options block shadow rounded-md border border-gray-200 outline-none px-3 py-2 mt-2 w-full">
        <% elsif TypeOfQuiz.find(params[:type_of_quiz]).type.name == "Mid-text-selecter" %>

SELECT "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---

        <% elsif TypeOfQuiz.find(params[:type_of_quiz]).type.name == "Select one" %>

SELECT "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---

         <% elsif TypeOfQuiz.find(params[:type_of_quiz]).type.name == "Mid text Selector" %>