app/views/type_of_quizzes/_type_of_quiz.html.erb

SELECT COUNT(*) FROM "questions" WHERE "questions"."type_of_quiz_id" = $1  [["type_of_quiz_id", 1]]
---
    <td class="px-6 py-4 whitespace-nowrap text-sm font-medium text-gray-900">
      <%= type_of_quiz.questions.count %>