app/controllers/image_uploads_controller.rb

INSERT INTO "questions" ("question", "options", "answer", "type_of_quiz_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---

  end

      Question.create({question:question,options:options,explanation: explanation, answer:correct_answer,type_of_quiz_id:type_of_quiz})