app/controllers/questions_controller.rb

  def index
    @questions = Question.where(type_of_quiz_id: params[:type_of_quiz])
---
SELECT "questions".* FROM "questions" WHERE "questions"."type_of_quiz_id" = ?  [["type_of_quiz_id", 1]]

  def new
    @question = Question.new
    @type_of_quiz_name=TypeOfQuiz.find(params[:type_of_quiz]).type.name
---
SELECT "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def edit
    @type_of_quiz_name=TypeOfQuiz.find(params[:type_of_quiz]).type.name
---
SELECT "types".* FROM "types" WHERE "types"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def create
    # @question = Question.new(question_params)

    # respond_to do |format|
    #   if @question.save
    #     format.html { redirect_to question_url(@question), notice: "Question was successfully created." }
    #     format.json { render :show, status: :created, location: @question }
    #   else
    #     format.html { render :new, status: :unprocessable_entity }
    #     format.json { render json: @question.errors, status: :unprocessable_entity }
    #   end
    # end

    question=params[:question]
    correct_answer=params[:correct_answer]
    type_of_quiz=params[:type_of_quiz]
    i=1
    options=[]
    while(!params["option#{i}"].nil?)
      options<<params["option#{i}"]
      i=i+1
    end
    Question.create({question:question,options:options,answer:correct_answer,type_of_quiz_id:type_of_quiz})
---
INSERT INTO "questions" ("question", "options", "answer", "type_of_quiz_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update_question
    question_id=params[:question_id]
    question=params[:question]
    correct_answer=params[:correct_answer]
    type_of_quiz=params[:type_of_quiz]
    i=1
    options=[]
    while(!params["option#{i}"].nil?)
      if params["option#{i}"] != ""
        options<<params["option#{i}"]
      end
      i=i+1
    end
    question_to_update=Question.find(question_id)
    question_to_update.update(question:question,options:options,answer:correct_answer,type_of_quiz_id:type_of_quiz)
---
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
UPDATE "questions" SET "question" = $1, "options" = $2, "answer" = $3, "updated_at" = $4 WHERE "questions"."id" = $5  [["question", "Dog __________ animal______________"], ["options", "---\n- is the\n- is a\n- the a\n"], ["answer", "is the"], ["updated_at", "2022-02-10 20:21:24.333094"], ["id", 27]]